In [1]:
import pandas as pd

In [26]:
df = pd.DataFrame({'one':['a','a','b','b','c'],
                  'two':[1,2,3,3,4],
                  'three':['Dg','Ct','Ct','Ct','Ln']})

In [27]:
df

  one  two three
0   a    1    Dg
1   a    2    Ct
2   b    3    Ct
3   b    3    Ct
4   c    4    Ln

In [5]:
# display unique value in paticular column
df['three'].unique()

array(['Dg', 'Ct', 'Ln'], dtype=object)

In [6]:
# display number of unique values
df['three'].nunique()

3

In [7]:
# Repeatation of unique charaters
df['three'].value_counts()

Ct    3
Dg    1
Ln    1
Name: three, dtype: int64

In [8]:
# Drop duplicate values
df.drop_duplicates()

  one  two three
0   a    1    Dg
1   a    2    Ct
2   b    3    Ct
4   c    4    Ln

In [9]:
df['two']*10

0    10
1    20
2    30
3    30
4    40
Name: two, dtype: int64

In [10]:
df

  one  two three
0   a    1    Dg
1   a    2    Ct
2   b    3    Ct
3   b    3    Ct
4   c    4    Ln

In [15]:
df['two'] = df['two']*20

In [16]:
df

  one  two three
0   a   20    Dg
1   a   40    Ct
2   b   60    Ct
3   b   60    Ct
4   c   80    Ln

In [19]:
def summ(a,b):
    c = a +b
    print(c)

summ(4,7)

11

In [36]:
def uservalue(animal):
    if animal == 'Dg':
        return 'Dog'
    elif animal == 'Ct':
        return 'Cat'
    elif animal == 'Ln':
        return 'Lion'

In [39]:
df['three'] = df['three'].apply(uservalue)

In [40]:
df

  one  two three  Four
0   a    1   Dog   Dog
1   a    2   Cat   Cat
2   b    3   Cat   Cat
3   b    3   Cat   Cat
4   c    4  Lion  Lion

In [41]:
# check max value in column
df['two'].max()

4

In [42]:
df['two'].min()

1

In [43]:
df['two'].idxmax()

4

In [44]:
df['two'].idxmin()

0

In [48]:
df.iloc[1]

one        a
two        2
three    Cat
Four     Cat
Name: 1, dtype: object